#+PROPERTY: header-args :results output :noweb yes

Instrumenting Narcissus for dynamic analyses in an elegant way.

Targeted instrumentations:
- faceted evaluation
- FlowR
- Theory of Information Labels
- Call graph

Also desirable:
- ES5 Strict mode
- Google Strong mode

** Time to test262
Running the test262 suite with one thread and excluding the tests that Narcissus
fails.

: jstests.py --xul-info:: --worker-count 1 --exclude-file=/home/fmarch12/Archimède/Thèse/lab/narcin/failure-raw-262 JS test262

Running the raw-facets version.

: ./jstests.py --xul-info=:: -j 1 --exclude-file=/home/fmarch12/Archimède/Thèse/lab/narcin/failure-raw-262 ~/Archimède/Thèse/lab/narcin/narcissus/njs --args='-F /home/fmarch12/Archimède/Thèse/lab/narcin/narcissus/shells/raw-facets.js' test262

Running the base + facets version.

: ./jstests.py --xul-info=:: -j 1 --exclude-file=/home/fmarch12/Archimède/Thèse/lab/narcin/failure-raw-262 ~/Archimède/Thèse/lab/narcin/narcissus/njs --args='-l base -l facets' test262

Times are in seconds.  First row are initial measurements.  Second group are
measurements made to measure variance between runs.

| Interpreter | Spidermonkey |    Raw |   Base | Facets (Austin) | Facets (us) |
|-------------+--------------+--------+--------+-----------------+-------------|
| 1 run       |         87.8 | 1167.1 | 1409.5 |          1232.9 |      1197.5 |
|-------------+--------------+--------+--------+-----------------+-------------|
| 5 runs      |         89.2 | 1041.8 | 1185.7 |                 |             |
|             |         88.6 | 1044.4 | 1197.5 |                 |             |
|             |           88 | 1048.5 | 1200.6 |                 |             |
|             |         86.3 | 1050.7 | 1198.6 |                 |             |
|             |         87.9 |        | 1199.3 |                 |             |

10 runs of Narcissus on test262.

|      |                   Raw |                  Base |       Facets (Austin) |            Facets (us) |       Base (no with) |
|------+-----------------------+-----------------------+-----------------------+------------------------+----------------------|
|      |                1046.3 |                1258.2 |                1204.0 |                 1303.8 |                950.5 |
|      |                1043.8 |                1284.8 |                1214.9 |                 1297.7 |                948.6 |
|      |                1040.3 |                1242.1 |                1211.5 |                 1301.5 |                953.1 |
|      |                1036.4 |                1197.5 |                1212.5 |                 1300.7 |                951.3 |
|      |                1035.0 |                1198.8 |                1207.7 |                 1300.1 |                948.9 |
|      |                1038.2 |                1197.0 |                1226.9 |                 1300.1 |                953.9 |
|      |                1038.3 |                1200.6 |                1218.1 |                 1298.3 |                947.8 |
|      |                1041.1 |                1200.8 |                1218.4 |                 1302.5 |                944.6 |
|      |                1041.4 |                1204.4 |                1220.0 |                 1307.4 |                940.5 |
|      |                1042.6 |                1203.5 |                1216.1 |                 1305.3 |                941.0 |
|------+-----------------------+-----------------------+-----------------------+------------------------+----------------------|
| Mean | 1040.34 +/- 1.0907897 | 1218.77 +/- 9.9313538 | 1215.01 +/- 2.0596359 | 1301.74 +/- 0.96726418 | 948.02 +/- 1.4756392 |
#+TBLFM: @12$2..@12$6=vmeane(@I..@II)


Seems there are some wild variations.  Better run the benchmarks a few times to
get an average and variance.

: for i in (seq 10); ./jstests.py --xul-info=:: -j 1 --exclude-file=/home/fmarch12/Archimède/Thèse/lab/narcin/failure-raw-262 ~/Archimède/Thèse/lab/narcin/narcissus/njs --args='-l base' test262; end

**** Using =with= as a shortcut
#+BEGIN_SRC js
  var I = (function(){
    var I  = {a:null, b:null, f:null, g:null}
    with(I) {
      var a = 1
      var b = 2
      var f = function f(x) { return x + a }
      var g = function g() { return f(b) }
    }
    return I
  }())

  print(I.g())
  I.a = 2
  print(I.g())
#+END_SRC

#+RESULTS:
: 3
: 4
: undefined

This how I would write it right away.  By wrapping everything in the module in a
=with(I)=, we are creating a new scope for =I=, that has the scope of the
anonymous function as a parent.  Even though =with= introduces a scope, the
variable declarations are hoisted to the top of the function body, so we have
the following code:

#+BEGIN_SRC js
 var I = (function(){
    var I, a, b, f, g
    var I  = {a:null, b:null, f:null, g:null}
    with(I) {
      a = 1
      b = 2
      f = function f(x) { return x + a }
      g = function g() { return f(b) }
    }
    return I
  }())
#+END_SRC

Then assignment affects the scope in which a binding is found for the left-hand
side.  =a= will be found in =I=, so that’s where the =1= will go.  The =a,b,f,g=
of the anonymous function scope will be left undefined.

Lookup also follows scope, and so =f(b)= will use the bindings inside =I= rather
than the function scope.

Thus, =I= acts exactly as the anonymous function scope, only we now have access
to it.

Finally, we return =I= as the exported module object, but we could return an
“interface” object alongside the instrumentation.

: return {g: g, _instrument: I}

For this to work however, we must put all the dynamic names inside the
declaration of =I=.  If a name does not appear in this declaration, then
assignment will fall back to the function scope.

#+BEGIN_SRC js
  var m = (function(){
    var I  = {}
    with(I) {
      var a = 1
      var b = 2
      function f(x) { return x + a }
      function g() { return f(b) }
    }
    return {g:g, _: I}
  }())

  print(m.g())
  m._.a = 2
  print(m.g())
#+END_SRC

#+RESULTS:
: 3
: 4
: undefined

Leaving =I= empty has the consequence that we can no longer access the values of
the bindings inside the body of =with=.  However, we can still change their
meaning dynamically, because we are manipulating the scope introduced by =with=,
which is inside the function scope.  In addition, the original scope cannot be
modified; we can always retrieve the original behavior by emptying =I._.I=.

All in all, this pattern allows one to:
1. Change all binding defined by the module code, as if we had dynamic scoping
   (though /it is not/ dynamic scoping, see below).
2. Expose the values of selected bindings by adding them to =I=.
3. Maintain compatibility with the module pattern: the code inside =with= needs
   not to be rewritten, and the return object still presents a public interface
   to the module.


This is not dynamic scoping.  In dynamic scoping, bindings are found on the call
stack.  Here bindings are statically bound to a dynamic object, which can be
modified at runtime.  But the binding is still static.  As such, we cannot
manipulate bindings that were not statically bound to the =with= object:
e.g. the bindings of functions defined outside =with=.

Is =with= safe to put around all your code like that?  Won’t it mess up all your
scope, and create hard-to-track bugs?

Well, =with= only introduces a scope from an object.  If that object is empty
(truly empty: no properties or inherited properties), then the scope is empty
and can have no effect whatsoever on the code it wraps.

Their is no interaction with =var= and =function= to be concerned with.  In the
following code, all bindings are hoisted to the function scope and not captured
by =I=.  As we export only =g=, the other bindings are not accessible from an
instrumentation point of view.

#+BEGIN_SRC js
  var m = (function(){
    var I  = Object.create(null)
    with(I) {
      var a = 1
      var b = 2
      function f(x) { return x + a }
      function g() { return f(b) }
    }
    return {g, _: I}
  }())

  print(m.g())
  m._.a = 2
  print(m.g())
#+END_SRC

#+RESULTS:
: 3
: 4
: undefined

However, later we can add bindings to =I= that will take precedence over the
bindings defined in the module.  This is precisely what we want when
instrumenting.

***** =var=
#+BEGIN_SRC js
var m = (function(){
  var I = Object.create(null)
  with(I) { var a = 0 }
  return {a, _: I}
}())

print(m.a)
print(m._.a)
m._.a = 1
print(m.a)
print(m._.a)
#+END_SRC

#+RESULTS:
: 0
: undefined
: 0
: 1
: undefined

=var= is hoisted to the function scope, and known outside =with=.

***** =const=
#+BEGIN_SRC js
var m = (function(){
  var I = Object.create(null)
  with(I) { const a = 0; print(a) }
  return { _: I}
}())

print(m.a)
print(m._.a)
m._.a = 1
print(m.a)
print(m._.a)
#+END_SRC

#+RESULTS:
: 0
: undefined
: undefined
: undefined
: 1
: undefined

=const= is not hoisted to the function scope, and is unknown at the time of
=return=.  It is only known inside =with=, but does not populate =I=.

***** =let=
#+BEGIN_SRC js
var m = (function(){
  var I = Object.create(null)
  with(I) { let a = 0; print(a) }
  return {_: I}
}())

print(m.a)
print(m._.a)
m._.a = 1
print(m.a)
print(m._.a)
#+END_SRC

#+RESULTS:
: 0
: undefined
: undefined
: undefined
: 1
: undefined

=let= acts like =const=: known only inside the body of =with=.

***** global
#+BEGIN_SRC js
var m = (function(){
  var I = Object.create(null)
  with(I) { a = 0 }
  return {a, _: I}
}())

print(m.a)
print(m._.a)
m._.a = 1
print(m.a)
print(m._.a)
print(a)
#+END_SRC

#+RESULTS:
: 0
: undefined
: 0
: 1
: 0
: undefined

=a = 0= is a global declaration, since there is no binding for =a= in =I=.

***** =function=
#+BEGIN_SRC js
var m = (function(){
  var I = Object.create(null)
  with(I) { function a() {} }
  return {a, _: I}
}())

print(m.a)
print(m._.a)
m._.a = 1
print(m.a)
print(m._.a)
#+END_SRC

#+RESULTS:
: function a() {}
: undefined
: function a() {}
: 1
: undefined

A =function= statement declaration is hoisted like a =var=, and hence is known
outside the body of =with=.

This suggest that we should always put the =return= in the body of =with= to
avoid surprises with unknown identifiers.  Thus wrapping the whole module
pattern.

***** Capturing bindings in the scope object
Rather than letter the bindings be hoisted to function scope, we can declare
empty bindings in =I=.  Then, =var= and =function= are /still/ hoisted, but
actual assignments will take place inside =I=.

#+BEGIN_SRC js
var m = (function(){
  var I = {a:null}
  with(I) {
    var a = 0
    return {a, _: I}
  }
}())

print(m.a)
print(m._.a)
m._.a = 1
print(m.a)
print(m._.a)
#+END_SRC

#+RESULTS:
: 0
: 0
: 0
: 1

This form has two major downsides:
1. =function= definitions are not captured in =I=.  We have to use the function
   expression form.
2. =I= /is/ the scope of the module, and changing a binding in =I= will be
   irreversible (unless we save them first).

**** Interaction with configurable, enumerable, writable properties
What happens if you muck with the data descriptor of the binding object?

- Enumerable :: the spec is clear (\sect10.2.1.2), non-enumerable properties can be used as
                bindings.
- Writable :: SetMutableBinding (\sect10.2.1.2.3) delegates to the Put internal
              method, so it obeys the writable property.
- Configurable :: DeleteBinding (\sect10.2.1.2.5) delegates to the Delete internal
                  method, and obeys the configurable property.

 Proof:
#+BEGIN_SRC js
  var o = Object.create(null)
  Object.defineProperty(o, 'a', {
      value: 42,
      configurable: false,
      writable: false,
      enumerable: false
  })

  ;(function(){
      with (o) {
          print(a)
      }}()) //: 42

  ;(function(){
      with (o) {
          a = 12
          print(a)
      }}()) //: 42

  ;(function(){
      with (o) {
          delete a
          print(a)
      }}()) //: 42
#+END_SRC

#+RESULTS:
: 42
: 42
: 42

A frozen binding object also works.  Though that would not be very useful for
instrumentation ...

**** Variants of the =with= pattern
The basic idea of this pattern is to provide a way to override bindings inside
the module, emulating (a limited form of) dynamic scoping.

For this to work, we only need to wrap all the code of the module in a =with(I)=
where =I= is an empty object, and export this object.  When a property is later
added to =I=, a function from the module will pick its bindings from =I= rather
than from the function scope.

This provides a way for instrumentation to /override/ any binding in the
module.

#+BEGIN_SRC js
  var m = (function(){
    var I  = Object.create(null)
    with(I) {
      ...
      return {... , __: I}
    }
  }())
#+END_SRC

For instrumentation purposes, we also need to /access/ the module bindings.
This can be done straightforwardly by adding all the bindings to the returned
object, like in the module pattern.  To avoid clashing with the public
interface, we can put them in a sub-object.

#+NAME: m
#+BEGIN_SRC js
  var m = (function(){
    var I  = Object.create(null)
    with(I) {
      var a = 0
      function g() { return a }
      return {g, _: {a} , __: I}
    }
  }())
#+END_SRC

Now we can write code outside the module using the bindings defined inside
the module.

#+BEGIN_SRC js
<<m>>
var f = function() { return m._.a + 1 }
print(m.g())
print(f())
#+END_SRC

#+RESULTS:
: 0
: 1

Now, suppose that I want to change the function =g= inside the module with a new
one.  I can easily do that by defining =g= in the exposed scope object.

#+BEGIN_SRC js
<<m>>
m.__.g = function() { return m._.a + 2 }
print(m.__.g())
#+END_SRC

#+RESULTS:
: 2

I can also write the function definition as if I was inside the module since I
have its scope definition.

#+BEGIN_SRC js
<<m>>
m.__.g = function() { with(m._) { return a + 2 }}
print(m.__.g())
#+END_SRC

#+RESULTS:
: 2

But what if I also redefine =a=?  Do I want to use the value of =a= defined by
the module (in object =m._=), or do I want to use the instrumented value (in
object =m.__=)?  I can do both by adding another =with=.

#+BEGIN_SRC js
<<m>>
m.__.a = 3
m.__.g = function() { with(m._) { with(m.__) {return a + 2 }}}
print(m.__.g())
print(m.g())
m.__.a = 5
print(m.__.g())
print(m.g())
#+END_SRC

#+RESULTS:
: 5
: 3
: 7
: 5

First look in the scope =m.__=, then in the scope =m._=.  This allows us to
change the result of =g= by just changing the binding of =a=.  In fact, if we
want to define =g= as if it was written inside the module itself, we /need/ to
provide this exact scope chain.

We can make this pattern shorter by setting =m._= as the prototype of =m.__=.
Thus, a binding lookup goes first through overrides, then module definitions,
and then upper scopes.

#+NAME: m-both-scopes
#+BEGIN_SRC js
  var m = (function(){
    var I  = Object.create(null)
    with(I) {
      var a = 0
      function g() { return a }
      Object.setPrototypeOf(I, {__proto__:null, a})
      return {g, _: Object.getPrototypeOf(I), __: I}
    }
  }())
#+END_SRC

We must set the prototype *after* all definitions, otherwise the bindings will
be captured by =I= and not by the function scope.

#+BEGIN_SRC js
<<m-both-scopes>>
m.__.g = function() { with(m.__) { return a + 2 }}
print(m.__.g())
print(m.g())
m.__.a = 5
print(m.__.g())
print(m.g())
#+END_SRC

#+RESULTS:
: 2
: 0
: 7
: 5

If we want, we can also update the public binding of =g= to point to our new
instrumented version.

#+BEGIN_SRC js
<<m-both-scopes>>
m.g = m.__.g = function() { with(m.__) { return a + 2 }}
print(m.g())
m.__.a = 5
print(m.g())
#+END_SRC

#+RESULTS:
: 2
: 7

In fact, the only point of adding =g= to the exposed scope of the module is if
some other inner function calls =g=.

**** Creating new modules with slight modifications
In the previous examples, we are able to alter the behavior of an existing
module.  What if we want to keep this module intact, but define a new one with
slightly altered behavior?

#+BEGIN_SRC js
  var m = (function(){
    var _  = Object.create(null)
    with(_) {
      var a = 0
      function f() { return a }
      function g() { return f() }
      return {_, g}
    }
  }())
#+END_SRC

Say, we want a new object that is like =m= except:
1. that =a= is 1
2. that =f= returns =a + 10=
3. that =g= returns =f() + f()=

and leaving =m= unaltered.

If we do not call the IIFE, we get a module constructor, and are then able to
create multiple copies of the module.  Each copy can be instrumented without
altering the others.

#+NAME: m-constructor
#+BEGIN_SRC js
  var m = function(){
    var _  = Object.create(null)
    with(_) {
      var a = 0
      function f() { return a }
      function g() { return f() }
      Object.setPrototypeOf(_, {__proto__:null, a, f})
      return {_, g}
    }
  }
#+END_SRC

#+BEGIN_SRC js
<<m-constructor>>
var m1 = m()
m1._.a = 1

print(m1.g())

var m2 = m()
m2._.f = function() { with(m2._) { return a + 10 }}

print(m2.g())

var m3 = m()
m3.g = function() { with(m3._) { return f() + f() }}

print(m3.g())
#+END_SRC

#+RESULTS:
: 1
: 10
: 0

Well, the module pattern is good for singletons, but not for multiple
instances.  By returning a closure, we are inefficiently creating multiple
copies of all the functions, and are unable to change them all at once.

Clearly, using inheritance would be a proper solution to this particular problem
of slight modifications.

* Independent layer activation
Reminiscent of Context-Oriented Programming.  We can compose instrumentations in
layers, like a cake.

#+BEGIN_EXAMPLE
-- base layer (interpreter)
-- facets instrumentation
-- trace instrumentation
#+END_EXAMPLE

In the ‘trace’ use case, we want the calls to =execute= in the facets layer to
trigger the tracing by using the =execute= binding in the trace layer.  Either
we write the facets layer to use the =execute= binding of its upper layer, or we
write it to always use the latest binding, going through all the layers.

In the following example, we use the latter solution.

#+BEGIN_SRC js
  // Like inserting a node in a singly-linked list
  function injectProto(o, target) {
    var ancestor = Object.getPrototypeOf(target)
    Object.setPrototypeOf(o, ancestor)
    Object.setPrototypeOf(target, o)
  }

  function cancelInjection(o, target) {

    while (Object.getPrototypeOf(target) !== o) {
      target = Object.getPrototypeOf(target)
    }

    Object.setPrototypeOf(target, Object.getPrototypeOf(o))
  }

  var m = (function(){
    var ___ = Object.create(null)
    with (___) {
      var a = 1
      function g() { return a }

      var exports = {__proto__: null, a,g}
      Object.setPrototypeOf(___, exports)
      return ___
    }
  }())

  print(m.g())

  var instr = {a:2}
  injectProto(instr, m)

  print(m.g())

  var instr2 = {g() { return m.a + 2 }}
  injectProto(instr2, m)

  print(m.g())

  cancelInjection(instr, m)

  print(m.g())
#+END_SRC

#+RESULTS:
: 1
: 2
: 4
: 3

Two downsides: the dynamic modification of the prototype, and the use of =with=
make this pattern difficult to optimize.  But we need to see how it affects
benchmarks.

